parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
    if (!rtc.begin())
    {
        solid_rgb_ring(RED_COLOR);
        Serial.println("RTC Connection Failed");
        update_oled("RTC", "Connection", "Failed");
        delay(1000);
    }

    solid_rgb_ring(GREEN_COLOR);
    Serial.println("RTC Connection Successful");
    update_oled("RTC", "Setup", "Done");
    delay(1000);
    return;
}

/**
 * @brief Setting Up OLED Module
 */
void oled_setup(void)
{
    display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
    display.clearDisplay();

    print_company_logo();
    delay(500);
    solid_rgb_ring(RED_COLOR);
    delay(500);
    solid_rgb_ring(YELLOW_COLOR);
    delay(500);
    solid_rgb_ring(GREEN_COLOR);
    delay(500);
    return;
}

/**
 * @brief Setup SD Card
 *
 */
void sd_setup(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    Serial.println("Setting up MicroSD Card");
    update_oled("Setting", "up", "MicroSD");
    delay(1000);

    if (!SD.begin(SD_CS))
    {
        solid_rgb_ring(RED_COLOR);
        Serial.println("MicroSd Card Mount Failed");
        update_oled("MicroSD", "Mount", "Failed");
        delay(1000);
    }
    else
    {
        solid_rgb_ring(GREEN_COLOR);
        Serial.println("MicroSD Card Mount Successful");
        update_oled("MicroSD", "Mount", "Done");
        delay(1000);
    }
}

/**
 * @brief Setting up the NeoPixels LED Ring
 */
void rgb_ring_setup(int led_brightness)
{
    pixels.begin();
    if (led_brightness > 100)
        led_brightness = EEPROM.read(LED_RING_BRIGHTNESS_STORED_LOCATION);
    Serial.println("\nCurrent LED Brightness: " + (String)led_brightness + '%');
    pixels.setBrightness(led_brightness * 255 / 100);
}

/**
 * @brief Setup AWS
 *
 */
void aws_setup(void)
{
    Serial.println("Setting up AWS");
    if (wifi_connection_status == 0)
        wifi_ntp_setup();
    if (wifi_connection_status == 1)
    {
        solid_rgb_ring(YELLOW_COLOR);
        Serial.println("Setting up AWS Connection");
        update_oled("AWS", "Setup", "Progress");
        delay(1000);

        // Connecting to Wi-Fi
        Serial.println("Connecting to Wi-Fi");
        WiFi.mode(WIFI_STA);
        WiFi.begin(ssid, password);
        while (WiFi.status() != WL_CONNECTED)
        {
            delay(50);
            Serial.print(".");
        }
        Serial.println("WI-Fi Connected");

        // Configure WiFiClientSecure to use the AWS IoT device credentials
        net.setCACert(cacert);
        net.setCertificate(client_cert);
        net.setPrivateKey(privkey);

        client.begin(MQTT_HOST, MQTT_PORT, net); // Connect to the MQTT broker on the AWS endpoint we defined earlier
        client.onMessage(messageReceived);       // Create a message handler

        connectToMqtt(false);
        read_aws_backlog_file(); // Upload the backlog data if any
        solid_rgb_ring(GREEN_COLOR);
        Serial.println("AWS Setup Complete");
        update_oled("AWS", "Setup", "Complete");
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        Serial.println("AWS Setup Failed");
        update_oled("AWS", "Setup", "Failed");
        delay(1000);
    }
}

// TODO: OLED Functions

/**
 * @brief Print Company Logo on OLED and turn the switch LED Ring to BLUE Color
 */
void print_company_logo(void)
{
    display.clearDisplay();
    display.drawBitmap(0, 0, COMPANY_LOGO, SCREEN_WIDTH, SCREEN_HEIGHT, WHITE);
    display.display();
    solid_rgb_ring(BLUE_COLOR);
    return;
}

/**
 * @brief Display String on OLED
 *
 * @param text1 Text on Line 1
 * @param text2 Text on Line 2
 * @param text3 Text on Line 3
 */
void update_oled(String text1, String text2, String text3)
{
    display.clearDisplay();
    display.setTextSize(OLED_TEXT_SIZE);
    display.setTextColor(WHITE);
    display.setCursor(0, 0);
    display.println(text1);
    display.setCursor(0, SCREEN_HEIGHT / 3);
    display.println(text2);
    display.setCursor(0, 2 * SCREEN_HEIGHT / 3);
    display.println(text3);
    display.display();
    return;
}

/**
 * @brief Display Menu Items on the OLED
 *
 * @param item1 Menu Item 1 on Line 1
 * @param item2 Menu Item 2 on Line 2
 * @param item3 Menu Item 3 on Line 3
 */
void oled_menu_update(String item1, String item2, String item3)
{
    display.clearDisplay();
    display.setTextSize(OLED_MENU_TEXT_SIZE);
    display.setTextColor(BLACK, WHITE);
    display.setCursor(0, 0);
    display.println(item1);
    display.setTextColor(WHITE);
    if (item1.length() < 11)
    {
        display.setCursor(0, SCREEN_HEIGHT / 3);
        display.println(item2);
        if (item2.length() < 11)
        {
            display.setCursor(0, 2 * SCREEN_HEIGHT / 3);
            display.println(item3);
        }
    }
    else
    {
        display.setCursor(0, 2 * SCREEN_HEIGHT / 3);
        display.println(item2);
    }
    display.display();
}

void update_splash_screen(void)
{
    Serial.println("Updating Splash Screen");
    lastMillis = millis();
    switch (main_screen_count)
    {
    case 1: // Printing Company Logo
        print_company_logo();
        break;

    case 2: // Shows the currently connected boxes
    {
        connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
        update_oled("Connected", "Boxes:", (String)connected_boxes);
    }
    break;

    case 3: // Checks the status of the Wi-Fi Connection
    {
        String wifi_connection_status = "Connected";
        if (WiFi.status() != WL_CONNECTED)
        {
            wifi_connection_status = "Disconn.";
            write_error_log(WIFI_NOT_CONNECTED);
        }
        update_oled("WiFi", ssid, wifi_connection_status);
    }
    break;

    case 4: // Fetches latest time from RTC
    {
        DateTime now = rtc.now();
        year = now.year();
        month = now.month();
        seconds = now.second();
        hour = now.hour();
        minutes = now.minute();
        seconds = now.second();

        String day = (String)year + '/' + (String)month + '/' + (String)date;
        String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
        update_oled("Date Time", day, time);
    }
    break;

