parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
    case 5: // Checks AWS Connection
    {
        String line2;
        String line3 = "Connected";
        if (client.connected())
            line2 = "Is";
        else
            line2 = "Not";
        update_oled("MQTT", line2, line3);
    }
    break;

    case 6: // Shows the latest Error Log
        update_oled("Latest", "Error", latest_error_log);
        break;

    default: // Set the main screen counter to zero
        main_screen_count = 0;
        break;
    }
    main_screen_count++;
    solid_rgb_ring(BLUE_COLOR);
    set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
}
// TODO: WiFi and NTP Functions
/**
 * @brief Tries to get local time from NTP:
 * -> If it's successful, The year, month, date, hour, minutes, seconds is updated to global variables with time from NTP,
 * and the time is saved to RTC.
 * -> If it fails, the fuction is called rtc_get_time()
 */
void printLocalTime(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    Serial.println("Updating NTP");
    update_oled("Updating", "NTP", "");
    delay(1000);
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo))
    {
        solid_rgb_ring(RED_COLOR);
        Serial.println("NTP Failed to Update");
        update_oled("NTP", "Update", "Failed");
        delay(1000);
        rtc_get_time();
        write_error_log(NTP_NOT_UPDATED); // Error Log
        return;
    }

    year = timeinfo.tm_year - 100;
    month = timeinfo.tm_mon + 1;
    date = timeinfo.tm_mday;
    hour = timeinfo.tm_hour;
    minutes = timeinfo.tm_min;
    seconds = timeinfo.tm_sec;

    solid_rgb_ring(GREEN_COLOR);
    Serial.println("NTP Update Successful");
    update_oled("NTP", "Update", "Success");
    delay(1000);
    String day = (String)year + '/' + (String)month + '/' + (String)date;
    String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
    Serial.println("Time from NTP:\n" + day + ' ' + time);
    update_oled("NTP Time", day, time);
    delay(1000);

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("RTC", "Update", "Progress");
    delay(1000);
    rtc.adjust(DateTime(year, month, date, hour, minutes, seconds));

    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Update", "Successful");
    delay(1000);
    return;
}

void notFound(AsyncWebServerRequest *request)
{
    request->send(404, "text/plain", "Not found");
}

/**
 * @brief Setup ESP as WiFi Router and get new login credentials
 * Reference: https://randomnerdtutorials.com/esp32-esp8266-input-data-html-form/
 */
void connect_to_new_wifi(void)
{
    solid_rgb_ring(RED_COLOR);
    update_oled("Wi-Fi", "Details", "Missing");
    Serial.println("Wi-Fi Login Details Unavailable");
    delay(1000);

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Connect", "To New", "Wi-Fi");
    Serial.println("Connecting to new Wi-Fi");
    delay(500);

    IPAddress local_ip(192, 168, 1, 1);
    IPAddress gateway(192, 168, 1, 1);
    IPAddress subnet(255, 255, 255, 0);
    WiFi.mode(WIFI_AP);
    char temp_ssid[] = "Box-It Router";
    char temp_pwd[] = "123456789";
    WiFi.softAP(temp_ssid, temp_pwd);
    WiFi.softAPConfig(local_ip, gateway, subnet);
    delay(100);
    Serial.println("Connect to:");
    Serial.println("SSID: " + (String)temp_ssid);
    Serial.println("Password: " + (String)temp_pwd);
    Serial.print("IP address: 192.168.4.1");

    // Send web page with input fields to client
    server.on("/", HTTP_GET, [](AsyncWebServerRequest *request)
              { request->send_P(200, "text/html", index_html); });

    // Send a GET request to <ESP_IP>/get?input1=<inputMessage>
    server.on("/get", HTTP_GET, [](AsyncWebServerRequest *request)
              {
                String inputMessage;
                String inputParam;
                // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
                if (request->hasParam(PARAM_INPUT_1))
                {
                    inputMessage = request->getParam(PARAM_INPUT_1)->value();
                    inputParam = PARAM_INPUT_1;
                    deleteFile(SD, SSID_FILE);
                    strcpy(ssid, inputMessage.c_str());
                    writeFile(SD, SSID_FILE, ssid);
                    Serial.println((String)ssid);
                    }
                    // GET input2 value on <ESP_IP>/get?input2=<inputMessage>
                else if (request->hasParam(PARAM_INPUT_2))
                {
                    inputMessage = request->getParam(PARAM_INPUT_2)->value();
                    inputParam = PARAM_INPUT_2;
                    deleteFile(SD, PASSWORD_FILE);
                    strcpy(password, inputMessage.c_str());
                    writeFile(SD, PASSWORD_FILE, password);
                    Serial.println((String)password);
                }
                else
                {
                    inputMessage = "No message sent";
                    inputParam = "none";
                }
                Serial.println(inputMessage);
                request->send(200, "text/html", "Saved " + inputParam + ": " + inputMessage + "<br><a href=\"/\">Enter Next Value</a>"); });
    server.onNotFound(notFound);
    server.begin();
    int i = 0;
    while (1)
    {
        if (digitalRead(outputS) == HIGH)
        {
            Serial.println("Restarting Device");
            update_oled("Restarting", "Device", "");
            delay(3000);
            ESP.restart();
            break;
        }
        if (i < 100)
            update_oled("SSID:", (String)temp_ssid, "");
        else if (i < 200)
            update_oled("Password:", (String)temp_pwd, "");
        else if (i < 500)
            update_oled("Connect @", "192.168.4.1", "");
        else
            i = 0;
        i++;
    }
}

// TODO: RTC Functions
/**
 * @brief Fetch Time from RTC and save it in global time variables
 *
 */
void rtc_get_time(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("RTC", "Update", "Progress");
    delay(1000);
    DateTime now = rtc.now();
    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Fetch", "Successful");
    delay(1000);
    year = now.year();
    month = now.month();
    seconds = now.second();
    hour = now.hour();
    minutes = now.minute();
    seconds = now.second();
    String day = (String)year + '/' + (String)month + '/' + (String)date;
    String time = (String)hour + ':' + (String)minutes + ':' + (String)seconds;
    Serial.println("Time from RTC:\n" + day + ' ' + time);
    update_oled("RTC Time", day, time);
    delay(1000);
    solid_rgb_ring(GREEN_COLOR);
    update_oled("RTC", "Update", "Successful");
    delay(1000);
    return;
}

// TODO: RGB NeoPixel Functions
/**
 * @brief Setting the RGB Ring Light to a solid color
 *
 * @param color pixels.Color(R:0-255, G:0-255, B:0-255)
 */
void solid_rgb_ring(uint32_t color)
{
    pixels.clear();
    for (size_t i = 0; i < NUMPIXELS; i++)
        pixels.setPixelColor(i, color);
    pixels.show();
    return;
}

/**
 * @brief Setting the LED Ring light one led at time to display progress bar on the pixel ring.
 *
 * @param led_number LED Ring Number
 */
void halt_rgb_ring(int led_number)
{
    pixels.clear();
    led_number = led_number % NUMPIXELS;
    pixels.setPixelColor(led_number, YELLOW_COLOR);
    pixels.show();
    return;
}

void change_led_ring_brightness(void)
{
    delay(500);
    int current_led_brightness = EEPROM.read(LED_RING_BRIGHTNESS_STORED_LOCATION);

    String item1 = "Brightness\nPercentage";
    String item2 = (String)current_led_brightness + '%';
    String item3 = "";
    oled_menu_update(item1, item2, item3);

    aLastState = digitalRead(outputA);
    while (1)
    {
        aState = digitalRead(outputA); // Reads the "current" state of the outputA
        if (aState != aLastState)
        {
            // If the outputB state is different to the outputA state, that means the encoder is rotating clockwise
            if (digitalRead(outputB) != aState)
                current_led_brightness++;
            else
                current_led_brightness--;

