parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
            if (current_led_brightness > 100)
                current_led_brightness = 100; // Ensures that the LED Brightness is not above 100%
            else if (current_led_brightness <= 0)
                current_led_brightness = 0; // Ensures that the LED Brightness is not below 0%

            item2 = (String)current_led_brightness + '%';
            rgb_ring_setup(current_led_brightness);
            solid_rgb_ring(BLUE_COLOR);
            oled_menu_update(item1, item2, item3);
        }
        aLastState = aState; // Updates the previous state of the outputA with the current state
        if (digitalRead(outputS) == HIGH)
        {
            delay(DEBOUNCE_TIME);
            if (digitalRead(outputS) == HIGH)
            {
                EEPROM.write(LED_RING_BRIGHTNESS_STORED_LOCATION, current_led_brightness);
                EEPROM.commit();
                Serial.println("Saving LED Brightness to memory");
                update_oled("Saving", "To", "Memory");
                delay(1000);
                break;
            }
        }
    }
    Serial.println("Exit");
    return;
}

// TODO: MicroSD Card Functions3
/**
 * @brief List All the Available Directories
 *
 * @param fs
 * @param dirname
 * @param levels
 */
void listDir(fs::FS &fs, const char *dirname, uint8_t levels)
{
    Serial.printf("Listing directory: %s\n", dirname);
    File root = fs.open(dirname);
    if (!root)
    {
        Serial.println("Failed to open directory");
        return;
    }
    if (!root.isDirectory())
    {
        Serial.println("Not a directory");
        return;
    }

    File file = root.openNextFile();
    while (file)
    {
        if (file.isDirectory())
        {
            Serial.print("  DIR : ");
            Serial.println(file.name());
            if (levels)
                listDir(fs, file.name(), levels - 1);
        }
        else
        {
            Serial.print("  FILE: ");
            Serial.print(file.name());
            Serial.print("  SIZE: ");
            Serial.println(file.size());
        }
        file = root.openNextFile();
    }
}

/**
 * @brief Create a Directory on SD Card
 *
 * @param fs SD Object
 * @param path The Location Path of the folder
 */
void createDir(fs::FS &fs, const char *path)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Creating", "Dir. in", "MicroSD");
    delay(1000);
    Serial.printf("Creating Dir: %s\n", path);
    if (fs.mkdir(path))
    {
        Serial.println("Dir created");
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Dir.", "Create", "Successful");
        delay(1000);
    }
    else
    {
        Serial.println("mkdir failed");
        solid_rgb_ring(RED_COLOR);
        update_oled("Dir.", "Create", "Failed");
        delay(1000);
    }
    return;
}

/**
 * @brief Delete the File
 *
 * @param fs SD Object
 * @param path
 */
void deleteFile(fs::FS &fs, const char *path)
{
    Serial.printf("Deleting file: %s\n", path);
    if (fs.remove(path))
        Serial.println("File deleted");
    else
        Serial.println("Delete failed");
}

/**
 * @brief Read a file on SD Card
 *
 * @param fs SD Object
 * @param path The Location path of the file
 * @return int Exit Status
 */
void readFile(fs::FS &fs, const char *path)
{
    String read_line = "";
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Reading", "File from", "MicroSD");
    Serial.printf("Reading file: %s\n", path);

    File file = fs.open(path);
    if (!file)
    {
        Serial.println("Failed to open file for reading");
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Open", "Failed");
    }

    Serial.print("Read from file: ");
    while (file.available())
        read_line = file.read();
    file.close();
    solid_rgb_ring(GREEN_COLOR);
    update_oled("File", "Read", "Successful");
}

/**
 * @brief Write to a file on SD Card
 *
 * @param fs SD Object
 * @param path Path of the file
 * @param message Message to be written in the file
 */
void writeFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Writing", "File to", "MicroSD");
    Serial.printf("Writing file: %s\n", path);

    File file = fs.open(path, FILE_WRITE);
    if (!file)
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Not", "Available");
        Serial.println("Failed to open file for writing");
        delay(1000);
        return;
    }
    if (file.print(message))
    {
        solid_rgb_ring(GREEN_COLOR);
        update_oled("File", "Write", "Successful");
        Serial.println("File written");
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Write", "Failed");
        Serial.println("Write failed");
        delay(1000);
    }
    file.close();
    return;
}

/**
 * @brief Append the message to the file
 * -> If file doesn't exist, then a new file is created and then written to it.
 *
 * @param fs SD Object
 * @param path Path of the file
 * @param message Message to be written to the file
 */
void appendFile(fs::FS &fs, const char *path, const char *message)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Appending", "File to", "MicroSD");
    Serial.printf("Appending to file: %s\n", path);

    File file = fs.open(path, FILE_APPEND);
    if (!file)
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("File", "Not", "Available");
        Serial.println("Failed to open file for appending");
        delay(1000);
        writeFile(SD, path, message);
        return;
    }
    if (file.print(message))
    {
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Message", "Append", "Successful");
        Serial.println("Message appended");
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Message", "Append", "Failed");
        Serial.println("Append failed");
        delay(1000);
    }
    file.close();
    return;
}

// TODO: Rotary Encoder Functions
/**
 * @brief Reads the Rotary Encoder and Update the OLED to interface the menu
 * After selecting the menu item, the respective function is executed.
 * The menu interface works in the below described method:
 * The menu is 2 levelled menu. The main menu and the sub menu.
 * Initially, the main menu is been scrolled through via oled, when the switch is pressed on rotary encoder,
 * the sub menu for the respective primary menu is selected.
 */
void read_rotary_encoder(void)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    delay(500);
    Serial.println("Enabling Rotary Encoder");

    int main_list_pos = 0;            // Position of the cursor on the main menu
    int sub_list_pos = 0;             // Position of the cursor on the sub list
    int menu_level = 0;               // Level of the cursor on the menu level
    int menu_item = 0;                // The value of the selected menu item
    int menu_length = MAIN_MENU_LIST; // Variable to store the number of items at the current menu level
    aLastState = digitalRead(outputA);

    // 3 items to display on the oled
    String item1 = main_menu[main_list_pos + 0][menu_level][sub_list_pos];
    String item2 = main_menu[main_list_pos + 1][menu_level][sub_list_pos];
    String item3 = main_menu[main_list_pos + 2][menu_level][sub_list_pos];
    oled_menu_update(item1, item2, item3);
    aLastState = digitalRead(outputA);
    while (1)
    {
        item1 = "";
        item2 = "";
        item3 = "";

        aState = digitalRead(outputA); // Reads the "current" state of the outputA
        if (aState != aLastState)
        {
            // If the outputB state is different to the outputA state, that means the encoder is rotating clockwise
            if (digitalRead(outputB) != aState)
                counter += 0.5;
            else
                counter -= 0.5;

