parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
        // Reading the data from EEPROM about previously connected boxes
        connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
        connected_boxes++;
        EEPROM.write(CONNECTED_BOXES_STORED_LOCATION, connected_boxes);
        EEPROM.commit();

        // Creating char array where the data in format<box_id><box_communication_address> is saved
        int n = BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + dt.length();
        char sd_message[n];
        strcpy(sd_message, (box_id + (String)save_sd_address + dt).c_str());
        appendFile(SD, BOX_ID_DETAILS_FILE, sd_message); // Appending the char array in SD Card
        read_box_details_from_sd_card();                 // Updating the box data and saving the new box in Box ID Array
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Added", "New Box", box_id);
        delay(1000);
        calibrate_box(box_id, communication_address); // Start Calibration in case of successful addition of new box
    }
    else // FALSE
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Failed", "New Box", box_id);
        delay(1000);
    }

    if (!client.connected()) // Uploading the data in AWS
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "add", connection_status, (String)save_sd_address, "", "");
    }
    return;
}

/**
 * @brief Calibrate the Box
 * Box is calibrated in the following method:
 * 1. NRF is set to the box_address as recieved, and the message "cali,<box_id>" is sent.
 * 2. Checks if recieved message is in the format "cali,ok":
 * 2.1 If message is not in format, AWS is notified.
 * 2.2 If message is in format, AWS is notified, delay of 30 sec is waited.
 * 2.2.1 After the delay of 30 secs, write to radio for the updated calibration data with message "calibration_data_update"
 * 2.2.2 Read the recieved message from NRF for the updated values
 * 2.2.3
 *
 * @param box_id Box ID
 * @param box_address Box Communication Address
 */
void calibrate_box(String box_id, byte *ptr_box_address)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Calibrating", "Box", box_id);
    delay(1000);

    // Writing the NRF with message "cali,<box_id>"
    String message = box_id + ",cali";
    write_radio(ptr_box_address, message);

    // Check if the message recieved is in required format or not
    set_radio_in_read_mode(ptr_box_address);
    int i = 0;
    String recieved_message = "";
    int max_attempts = 50;
    while (i < max_attempts)
    {
        if (radio.available())
        {
            recieved_message = read_radio();
            break;
        }
        delay(100);
        i++;
    }

    int connection_status = 0; // 0 -> Failure, 1 -> Success
    // Check if the NRF connection was successful or not
    if (recieved_message = ("cali,ok"))
    {
        connection_status = 1;
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Calibration", "Connect", "Successful");
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Calibration", "Connect", "Failed");
        delay(1000);
    }

    // AWS is contacted and updated if calibration is successful or not
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data((String)box_id, "calibrate", connection_status, "", "", "");
    }

    if (connection_status == 1)
    {
        delay(30 * 1000);                                                  // Wait for calibration to complete
        write_radio(ptr_box_address, box_id + ",calibration_data_update"); // Write to radio fpr updated values
        set_radio_in_read_mode(ptr_box_address);
        int i = 0;
        String update_message = "";
        int max_attempts = 50;
        while (i < max_attempts)
        {
            if (radio.available())
            {
                update_message = read_radio();
                break;
            }
            delay(100);
            i++;
        }

        if (update_message != "") // Check if the radio message is not empty
        {
            solid_rgb_ring(GREEN_COLOR);
            update_oled("Calibration", "Successful", box_id);
            delay(1000);
            // Creating Directory of Format YYYY/MM/
            String str_dir = '/' + (String)year + '/' + (String)month;
            int dir_size = str_dir.length();
            char dir[dir_size]; // Str to Char conversion
            strcpy(dir, str_dir.c_str());
            createDir(SD, dir);

            // Creating File Path
            String str_file_path = '/' + (String)year + '/' + (String)month + '/' + (String)date + file_extension;
            int path_size = str_file_path.length();
            char file_path[path_size]; // Str to Char conversion
            strcpy(file_path, str_file_path.c_str());

            // Converting data into required format
            String str_sd_message = year + '/' + month + '/' + date + ' ' + hour + ':' + minutes + ':' + seconds + ' ' + box_id + ' ' + update_message;
            int msg_size = str_sd_message.length(); // Calculating the message size
            char sd_message[msg_size];              // Str to Char conversion
            strcpy(sd_message, str_sd_message.c_str());
            appendFile(SD, file_path, sd_message);

            if (wifi_connection_status == 1)
            {
                if (!client.connected())
                    checkWiFiThenMQTT();
                else
                {
                    client.loop();
                    send_Success_Data((String)box_id, "calibration_update", connection_status, update_message, "", "");
                }
            }
            else
                appendFile(SD, AWS_BACKLOG_FILE, sd_message);
        }
        else
        {
            connection_status = 0;
            solid_rgb_ring(RED_COLOR);
            update_oled("Calibration", "Failed", box_id);
            delay(1000);
        }
    }
    return;
}

/**
 * @brief Contact the Boxes to collect the data from it
 *
 * @param box_id
 * @param box_address
 */
void update_box_data(String box_id, byte *ptr_box_address, String required_params)
{
    char token = '/';
    char params[UPDATE_PARAMETERS];
    int j = 0;
    int recieved_params = sizeof(required_params) / sizeof(required_params[0]);
    for (int i = 0; i < recieved_params; i++)
    {
        if (required_params[i] != token)
            params[j] = required_params[i];
        else
            j++;
    }

    // Write radio with the address recieved
    String write_message = box_id + ",updt,";
    for (size_t i = 0; i < recieved_params; i++)
        write_message += {(String)params[i] + ','};
    write_radio(ptr_box_address, write_message);

    // Read the radio
    set_radio_in_read_mode(ptr_box_address);
    int i = 0;
    String message = "";
    int max_attempts = 50;
    while (i < max_attempts)
    {
        if (radio.available())
        {
            message = read_radio();
            break;
        }
        delay(100);
        i++;
    }

    if (message != "")
    {
        // Creating Directory of Format YYYY/MM/
        String str_dir = '/' + (String)year + '/' + (String)month;
        int dir_size = str_dir.length();
        char dir[dir_size]; // Str to Char conversion
        strcpy(dir, str_dir.c_str());
        createDir(SD, dir);

        // Creating File Path
        String str_file_path = '/' + (String)year + '/' + (String)month + '/' + (String)date + file_extension;
        int path_size = str_file_path.length();
        char file_path[path_size]; // Str to Char conversion
        strcpy(file_path, str_file_path.c_str());

        // Converting data into required format
        String str_sd_message = year + '/' + month + '/' + date + ' ' + hour + ':' + minutes + ':' + seconds + ' ' + box_id + ' ' + message;
        int msg_size = str_sd_message.length(); // Calculating the message size
        char sd_message[msg_size];              // Str to Char conversion
        strcpy(sd_message, str_sd_message.c_str());

        appendFile(SD, file_path, sd_message);

        if (wifi_connection_status == 1)
        {
            if (!client.connected())
                checkWiFiThenMQTT();
            else
            {
                client.loop();
                sendData(box_id, message, "na");
            }
        }
        else
            appendFile(SD, AWS_BACKLOG_FILE, sd_message);
    }
}

/**
 * @brief Change Box Settings
 *
 * @param box_id
 * @param box_address
 * @param dt
 * @param st
 * @param bt
 */
void change_box_setting(String box_id, byte *ptr_box_address, String identifiers)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Change", "Setting", box_id);
    delay(1000);

