parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
    int success_code = 0;
    char token = '/';
    char params[UPDATE_PARAMETERS];
    int j = 0;
    int recieved_params = sizeof(identifiers) / sizeof(identifiers[0]);
    for (int i = 0; i < recieved_params; i++)
    {
        if (identifiers[i] != token)
            params[j] = identifiers[i];
        else
            j++;
    }

    // Write radio with the address recieved
    String message = box_id + ",chng,";
    for (size_t i = 0; i < recieved_params; i++)
        message += {(String)params[i] + ','};
    write_radio(ptr_box_address, message);
    set_radio_in_read_mode(ptr_box_address);
    int i = 0;
    String recieved_message = "";
    int max_attempts = 50;
    while (i < max_attempts)
    {
        if (radio.available())
        {
            recieved_message = read_radio();
            break;
        }
        delay(100);
        i++;
    }

    if (recieved_message == "chng,ok")
    {
        success_code = 1;
        solid_rgb_ring(GREEN_COLOR);
        update_oled("Setting", "Successful", box_id);
        delay(1000);
    }
    else
    {
        solid_rgb_ring(RED_COLOR);
        update_oled("Setting", "Failed", box_id);
        delay(1000);
    }

    // Update to AWS
    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        send_Success_Data(box_id, "change", success_code, "", "", "");
    }
}

/**
 * @brief Buzz the box
 *
 * @param box_id
 * @param box_address
 */
void sound_buzzer(String box_id, byte *ptr_box_address)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Buzz", "Box", box_id);
    delay(1000);
    String message = box_id + ",buzz";
    write_radio(ptr_box_address, message);
    solid_rgb_ring(GREEN_COLOR);
    update_oled("Buzz", "Box", "Successful");
    delay(1000);
}

void reciever_initiated_call()
{
    Serial.println("Box Initiated Communication on NRF");
    String msg = read_radio();
    char char_msg[2][BOX_ID_LENGTH];
    int j = 0;
    int seperation = 0;
    for (size_t i = 0; i < msg.length(); i++)
    {
        if (msg[i] != ',')
            char_msg[j][i - seperation] = msg[i];
        else
        {
            j++;
            seperation++;
        }
    }
    String box_id = (String)char_msg[0];
    String param = (String)char_msg[1];

    if (box_id.length() == BOX_ID_LENGTH) // Checks if the box initiated contact by sending its box id
    {
        String str_box_address = "";
        str_box_address = fetch_box_address(box_id); // Checks the box id is in database for address
        if (str_box_address != "")
        {
            byte box_address[COMMUNICATION_ID_LENGTH];
            for (size_t i = 0; i < count; i++)
                box_address[i] = str_box_address[i];
            if (param == "updt")
                update_box_data(box_id, box_address, PERIODIC_UPDATE_VALUES);
            else if (param == "cali")
                calibrate_box(box_id, box_address);
        }
    }
    set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
}

// TODO: NRF24 Functions
/**
 * @brief Write a message to the NRF Radio
 *
 * @param transmission_address 5 byte Transmission Address
 * @param transmission_message 32 byte Transmission Message
 */
void write_radio(byte ptr_transmission_address[], String transmission_message)
{
    update_oled("Sending", "Message", "via NRF");
    Serial.println("Writing Message: " + transmission_message);
    radio.openWritingPipe(ptr_transmission_address);
    radio.setPALevel(RF24_PA_MIN);
    radio.stopListening();
    delay(100);
    radio.write(&transmission_message, sizeof(transmission_message));
    delay(50);
    update_oled("NRF", "Message", "Sent");
    return;
}

void set_radio_in_read_mode(byte ptr_recieving_address[])
{
    radio.openReadingPipe(0, ptr_recieving_address);
    radio.setPALevel(RF24_PA_MIN);
    radio.startListening();
    delay(100);
}

String read_radio(void)
{
    update_oled("Recieved", "Message", "via NRF");
    delay(1000);
    String recieved_message = "";
    radio.read(&recieved_message, sizeof(recieved_message));
    return recieved_message;
}

/**
 * @brief This function is used to fetch the latest data from each boxes on periodic instances.
 * This is activated when the Timer is activated and increases the count variable till its greater than the timer count.
 */
void regular_box_update(int counter)
{
    timerStop(timer);
    timerAlarmDisable(timer);

    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Box", "Polling", "Start");
    delay(1000);
    rtc_get_time();
    connected_boxes = EEPROM.read(CONNECTED_BOXES_STORED_LOCATION);
    for (int i = 0; i < connected_boxes; i++)
    {
        halt_rgb_ring(i);
        int dt = BOX_DT_TIME_DETAILS[i];
        Serial.println("dt: " + (String)dt);

        if (counter % (dt * 60) == 0)
        {
            String box_id = BOX_DETAILS[i][0];
            String address = BOX_DETAILS[i][1];
            byte box_address[COMMUNICATION_ID_LENGTH];
            for (size_t i = 0; i < COMMUNICATION_ID_LENGTH; i++)
                box_address[i] = address[i];

            update_oled("Contacting", "Box", box_id);
            update_box_data(box_id, box_address, PERIODIC_UPDATE_VALUES);
        }
    }

    solid_rgb_ring(GREEN_COLOR);
    update_oled("Box", "Polling", "Completed");
    delay(1000);
    timerStart(timer);
    timerAlarmEnable(timer);
    print_company_logo();
    set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
}

/**
 * @brief Fetch Box Address from the Box ID Array matrix
 *
 * @param box_id 9 byte Box ID
 * @return String 5 byte Box Communication Address
 */
String fetch_box_address(String box_id)
{
    int i;
    for (i = 0; i < connected_boxes; i++)
    {
        String box = BOX_DETAILS[i][0];
        if (box == box_id)
            break;
    }
    String address = BOX_DETAILS[i][1];
    return address;
}

// TODO: Auxillary Functions
/**
 * @brief Reading the SD Card File which stores the "Box ID and communication Address"
 */
void read_box_details_from_sd_card(void)
{
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Read", "Box Details", "From SD");
    Serial.println("Reading Box Details");
    delay(1000);
    RL.readLines(BOX_ID_DETAILS_FILE, &handleEachLine);
    solid_rgb_ring(GREEN_COLOR);
    update_oled("Box Details", "Read", "Done");
    delay(1000);
    return;
}

/**
 * @brief Read File Line by Line
 *
 * @param line The Line to be read and saved
 * @param lineIndex The Index of the Line to be worked on
 */
void handleEachLine(char line[], int lineIndex)
{
    char box_id[BOX_ID_LENGTH];
    char address[COMMUNICATION_ID_LENGTH];
    char delay_time[2];

    for (int i = 0; i < (BOX_ID_LENGTH + COMMUNICATION_ID_LENGTH + 2); i++)
    {
        if (i < BOX_ID_LENGTH)
        {
            box_id[i] = line[i];
        }
        else if (i < COMMUNICATION_ID_LENGTH)
        {
            address[i - BOX_ID_LENGTH] = line[i];
        }
        else
        {
            delay_time[i - BOX_ID_LENGTH - COMMUNICATION_ID_LENGTH] = line[i];
        }
    }

