parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
    BOX_DETAILS[lineIndex][0] = (String)box_id;
    BOX_DETAILS[lineIndex][1] = (String)address;
    BOX_DT_TIME_DETAILS[lineIndex] = atoi(delay_time);
    Serial.println("Box ID: " + BOX_DETAILS[lineIndex][0] + '\n' + "Box Address: " + BOX_DETAILS[lineIndex][1] + '\n' + "Delay Time: " + BOX_DETAILS[lineIndex][2]);
    return;
}

/**
 * @brief Read Error Log File Line by Line and save the latest error log on the variable
 *
 * @param line
 * @param lineIndex
 */
void handleEachErrorLine(char line[], int lineIndex)
{
    char error_log[ERROR_LOG_LENGTH];
    latest_error_log = (String)line;
    return;
}

/**
 * @brief Read Line by Line for SSID File
 *
 * @param line
 * @param lineIndex
 */
void handleEachSSIDLine(char line[], int lineIndex)
{
    for (size_t i = 0; i < SSID_CHAR_LENGTH; i++)
        ssid[i] = line[i];
}
/**
 * @brief Read Line by Line for Password File
 *
 * @param line
 * @param lineIndex
 */
void handleEachPasswordLine(char line[], int lineIndex)
{
    for (size_t i = 0; i < PASSWORD_CHAR_LENGTH; i++)
        password[i] = line[i];
}

/**
 * @brief Write Error Log to SD Card in ERROR_LOG_FILE
 * Format: YYYY/MM/DD-HH:MM:SS-#<XXXX>
 * <XXXX> - Error Code
 * @param error_log_tag
 */
void write_error_log(String error_log_tag)
{
    // Writing Error
    String str_error_log = (String)hour + ':' + (String)minutes + ' ' + error_log_tag;
    latest_error_log = str_error_log;
    char error_log[ERROR_LOG_LENGTH];
    strcpy(error_log, latest_error_log.c_str());
    writeFile(SD, ERROR_LOG_FILE, error_log);
}

// TODO: AWS Functions

/**
 * @brief This function is activated when the message is recieved from AWS
 *
 * @param topic
 * @param payload
 */
void messageReceived(String &topic, String &payload)
{
    timerStop(timer);
    timerAlarmDisable(timer);
    // Reference (JSON to String Converter): https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonParserExample/JsonParserExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("Message", "Recieved", "from AWS");
    delay(1000);
    Serial.println("Recieved [" + topic + "]: " + payload);
    StaticJsonDocument<200> doc;
    DeserializationError error = deserializeJson(doc, payload);
    if (error)
    {
        Serial.print(F("deserializeJson() failed: "));
        Serial.println(error.f_str());
        return;
    }
    String box_id = doc["boxid"];
    String cmd = doc["cmd"];
    if (box_id == NULL)
        update_oled("No", "Data", "Recieved");
    else
        update_oled(box_id, cmd, "");
    String address = fetch_box_address(box_id);
    // Perform action as per the command from AWS
    if (cmd == "add") // Add new Box
    {
        String dt = doc["dt"];
        add_new_box(box_id, dt);
    }
    else
    {
        String address = fetch_box_address(box_id);
        byte box_address[COMMUNICATION_ID_LENGTH];
        for (size_t i = 0; i < COMMUNICATION_ID_LENGTH; i++)
            box_address[i] = address[i];
        if (cmd == "calibrate") // Calibrate box parameters
            calibrate_box(box_id, box_address);
        else if (cmd == "ask") // Ask box for updated values
        {
            String required_params = doc["identifier"];
            rtc_get_time();
            solid_rgb_ring(YELLOW_COLOR);
            update_oled("Update", "Box", "Progress");
            update_box_data(box_id, box_address, required_params);
            solid_rgb_ring(GREEN_COLOR);
            update_oled("Update", "Box", "Successful");
        }
        else if (cmd == "change_setting") // Change box settings
        {
            String identifiers = doc["identifier"];
            change_box_setting(box_id, box_address, identifiers);
        }
        else if (cmd == "buzz")
            sound_buzzer(box_id, box_address);
    }
    solid_rgb_ring(GREEN_COLOR);
    update_oled("AWS", "MSG Recieved", "Complete");
    timerStart(timer);
    timerAlarmEnable(timer);
}

void read_aws_backlog_file()
{
    Serial.println("Reading Backlog Files");
    RL.readLines(BOX_ID_DETAILS_FILE, &handleEachAWSBacklogLine);
    deleteFile(SD, AWS_BACKLOG_FILE);
}

void handleEachAWSBacklogLine(char line[], int lineIndex)
{
    char data[4][20]; // date,time,boxid,message
    int j = 0;
    int shift_val = 0;
    for (int i = 0; i < (sizeof(line) / sizeof(line[0])); i++)
    {
        if (line[i] != ' ')
            data[j][i - shift_val] = line[i];
        else
        {
            j++;
            shift_val = i;
        }
    }

    String date_time = (String)data[0] + ' ' + (String)data[1];
    String box_id = (String)data[2];
    String message = (String)data[3];
    char error_log[ERROR_LOG_LENGTH];
    strcpy(error_log, latest_error_log.c_str());

    if (!client.connected())
        checkWiFiThenMQTT();
    else
    {
        client.loop();
        sendData(box_id, message, date_time);
    }

    return;
}

void lwMQTTErr(lwmqtt_err_t reason)
{
    if (reason == lwmqtt_err_t::LWMQTT_SUCCESS)
        Serial.print("Success");
    else if (reason == lwmqtt_err_t::LWMQTT_BUFFER_TOO_SHORT)
    {
        write_error_log("#002");
        Serial.print("Buffer too short");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_VARNUM_OVERFLOW)
    {
        write_error_log("#003");
        Serial.print("Varnum overflow");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_CONNECT)
    {
        write_error_log("#004");
        Serial.print("Network failed connect");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_TIMEOUT)
    {
        write_error_log("#005");
        Serial.print("Network timeout");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_READ)
    {
        write_error_log("#006");
        Serial.print("Network failed read");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_NETWORK_FAILED_WRITE)
    {
        write_error_log("#007");
        Serial.print("Network failed write");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_OVERFLOW)
    {
        write_error_log("#008");
        Serial.print("Remaining length overflow");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_REMAINING_LENGTH_MISMATCH)
    {
        write_error_log("#009");
        Serial.print("Remaining length mismatch");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_MISSING_OR_WRONG_PACKET)
    {
        write_error_log("#010");
        Serial.print("Missing or wrong packet");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_CONNECTION_DENIED)
    {
        write_error_log("#011");
        Serial.print("Connection denied");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_FAILED_SUBSCRIPTION)
    {
        write_error_log("#012");
        Serial.print("Failed subscription");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_SUBACK_ARRAY_OVERFLOW)
    {
        write_error_log("#013");
        Serial.print("Suback array overflow");
    }
    else if (reason == lwmqtt_err_t::LWMQTT_PONG_TIMEOUT)
    {
        write_error_log("#014");
        Serial.print("Pong timeout");
    }
}

void lwMQTTErrConnection(lwmqtt_return_code_t reason)
{
    if (reason == lwmqtt_return_code_t::LWMQTT_CONNECTION_ACCEPTED)
        Serial.print("Connection Accepted");
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNACCEPTABLE_PROTOCOL)
    {
        write_error_log("#015");
        Serial.print("Unacceptable Protocol");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_IDENTIFIER_REJECTED)
    {
        write_error_log("#016");
        Serial.print("Identifier Rejected");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_SERVER_UNAVAILABLE)
    {
        write_error_log("#017");
        Serial.print("Server Unavailable");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_BAD_USERNAME_OR_PASSWORD)
    {
        write_error_log("#018");
        Serial.print("Bad UserName/Password");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_NOT_AUTHORIZED)
    {
        write_error_log("#019");
        Serial.print("Not Authorized");
    }
    else if (reason == lwmqtt_return_code_t::LWMQTT_UNKNOWN_RETURN_CODE)
    {
        write_error_log("#020");
        Serial.print("Unknown Return Code");
    }
}

void connectToMqtt(bool nonBlocking)
{
    Serial.print("MQTT connecting ");
    while (!client.connected())
    {
        if (client.connect(THINGNAME))
        {
            Serial.println("connected!");
            if (!client.subscribe(MQTT_SUB_TOPIC))
                lwMQTTErr(client.lastError());
        }
        else
        {
            Serial.print("SSL Error Code: ");
            //  Serial.println(net.getLastSSLError());
            Serial.print("failed, reason -> ");
            lwMQTTErrConnection(client.returnCode());
            if (!nonBlocking)
            {
                Serial.println(" < try again in 5 seconds");
                delay(5000);
            }
            else
            {
                Serial.println(" <");
            }
        }
        if (nonBlocking)
            break;
    }
}

void checkWiFiThenMQTT(void)
{
    wifi_ntp_setup();
    connectToMqtt(false);
}

