parth-20-07/Inventory-Management-System/V3 ESP32 Reciever Code/src/main.cpp
unsigned long previousMillis = 0;
const long interval = 5000;

void checkWiFiThenMQTTNonBlocking(void)
{
    wifi_ntp_setup();
    if (millis() - previousMillis >= interval && !client.connected())
    {
        previousMillis = millis();
        connectToMqtt(true);
    }
}

void checkWiFiThenReboot(void)
{
    wifi_ntp_setup();
    Serial.print("Rebooting");
    ESP.restart();
}

/**
 * @brief Upload data from special protocols to AWS
 *
 * @param box_id
 * @param command
 * @param success_status
 * @param param1
 * @param param2
 */
void send_Success_Data(String box_id, String command, int success_status, String param1, String param2, String param3)
{
    // Reference (String to JSON Converter):https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino
    solid_rgb_ring(YELLOW_COLOR);
    update_oled("AWS", "Upload", "InProgess");
    StaticJsonDocument<200> doc;
    doc["boxid"] = box_id;
    doc["cmd"] = command;
    doc["success"] = success_status;
    if (command == "add")
        doc["boxaddress"] = param1;
    else if (command == "calibration_update")
    {
        if (success_status == 1)
        {
            // Seperating each recieved parameter and values in format: <identifier>:<value>
            char token = ',';
            int j = 0;
            int k = 0;
            char formatted_param[UPDATE_PARAMETERS][12];
            for (int i = 0; i < UPDATE_PARAMETERS; i++)
            {
                if (param1[i] != token)
                {
                    formatted_param[j][k] = param1[i];
                    k++;
                }
                else
                {
                    j++;
                    k = 0;
                }
            }
            // Seperating each recieved parameter and values in different matrix
            char params[j];
            char param_values[j][10];
            for (size_t i = 0; i < j; i++)
            {
                params[i] = formatted_param[i][0];
                for (size_t k = 2; k < count; k++)
                    param_values[i][k - 2] = formatted_param[i][k];
            }
            // Converting the data to json format
            for (size_t i = 0; i < j; i++)
                doc[(String)params[i]] = (String)param_values[i];
        }
    }
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    //   "param3": "param3_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));
    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", command, "Failure");
    }
    else
        update_oled("AWS", command, "Success");
}

/**
 * @brief Upload data to AWS for periodic box updates
 *
 * @param box_id
 * @param message
 */
void sendData(String box_id, String message, String date_time)
{
    // Reference:https://github.com/bblanchon/ArduinoJson/blob/6.x/examples/JsonGeneratorExample/JsonGeneratorExample.ino

    // Seperating the comma seperated values from message in format "<param_letter>:<param_value>"
    Serial.println("Sending to AWS");
    char token = ',';
    char formatted_params[UPDATE_PARAMETERS][12];
    int j = 0;
    int k = 0;
    for (int i = 0; i < (sizeof(message) / message[0]); i++)
    {
        if (message[i] != token)
        {
            formatted_params[j][k] = message[i];
            k++;
        }
        else
        {
            j++;
            k = 0;
        }
    }

    // Seperating the colon seperated value and identifier and storing it in different arrays
    char params[j + 1]; // j signifies the number of recieved params
    char param_values[j + 1][10];
    for (size_t i = 0; i < (j + 1); i++)
    {
        params[i] = formatted_params[i][0]; // Saving the param identifier in params matrix
        for (size_t k = 2; k < (sizeof(formatted_params[j]) / sizeof(formatted_params[j][0])); k++)
            param_values[i][k - 2] = formatted_params[i][k];
    }

    // Converting the data into JSON Format
    StaticJsonDocument<200> doc;
    if (date_time == "na")
        doc["time"] = (String)year + '/' + (String)month + '/' + (String)date + ' ' + (String)hour + ':' + (String)minutes + ':' + (String)seconds;
    else
        doc["time"] = date_time;
    doc["boxid"] = box_id;
    doc["cmd"] = "update";
    for (size_t i = 0; i < (j + 1); i++)
        doc[(String)params[i]] = (String)param_values[i];
    serializeJson(doc, Serial);
    serializeJsonPretty(doc, Serial);
    // The above line prints:
    // {
    //   "Box ID": "123456789",
    //   "cmd": add,
    //   "success": 1,
    //   "param1": "param1_data",
    //   "param2": "param2_data",
    // }
    char shadow[measureJson(doc) + 1];
    serializeJson(doc, shadow, sizeof(shadow));

    if (!client.publish(MQTT_PUB_TOPIC, shadow, false, 0))
    {
        lwMQTTErr(client.lastError());
        update_oled("AWS", "update", "Failure");
    }
    else
        update_oled("AWS", "update", "Success");
}

// TODO: Basic Setup, Code Operation Starts here
void setup()
{
    Serial.begin(115200);
    pin_setup();
    EEPROM.begin(EEPROM_SIZE);
    rgb_ring_setup(110);
    oled_setup();
    nrf24_setup();
    sd_setup();
    wifi_ntp_setup();
    aws_setup();
    read_box_details_from_sd_card();
    RL.readLines(ERROR_LOG_FILE, &handleEachErrorLine);
    // if (BOX_DETAILS[0][0] == NULL)
    // {
    //     solid_rgb_ring(RED_COLOR);
    //     if (wifi_connection_status == 0)
    //     {
    //         update_oled("Device", "Not", "Connected");
    //         delay(1000);
    //         connect_to_new_wifi();
    //     }
    //     update_oled("No", "Box", "Linked");
    //     Serial.println("No Box Linked");
    //     while (BOX_DETAILS[0][0] == NULL)
    //     {
    //         Serial.println("reading");
    // client.loop();
    //     }
    // }
    // configure_timer();
    // timerAlarmEnable(timer);
    print_company_logo();
    lastMillis = millis();
    set_radio_in_read_mode(BROADCAST_RECIEVER_ADDRESS);
}

// TODO: Loop for the code
void loop()
{
    // //? Detects when the rotary encoder button is pressed
    if (digitalRead(outputS) == HIGH)
    {
        delay(3 * DEBOUNCE_TIME); // Debounce time
        if (digitalRead(outputS) == HIGH)
            read_rotary_encoder(); // Open Main Menu
    }

    //? When Count variable overflows the Timer Value, the periodic box polling is done
    if ((count != 0) && ((count % 5) == 0))
    {
        if (previous_count != count)
        {
            write_radio(BROADCAST_RECIEVER_ADDRESS, "Hello");
            // regular_box_update(count);
            if (count >= DELAY_SIXTY_MINUTES)
                count = 0;
            previous_count = count;
        }
    }

    // //? Main Splash Screen Cycle
    if ((millis() - lastMillis) > MAIN_SCREEN_REFRESH_TIME)
        update_splash_screen();

    //? Polls NRF24 to collect live data from boxes
    if (radio.available())
        reciever_initiated_call();

    //? Polling AWS for recieved data
    sendData("123456789", "c:5,b:10,t:15", "na");
    client.loop();
    delay(5000);
}